app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "World History"], ["room_number", 586], ["created_at", "2020-12-24 16:57:10.531042"], ["updated_at", "2020-12-24 16:57:10.531042"]]
---
    def create
        # @school_class = SchoolClass.new
        # @school_class.title = params[:title]
        # @school_class.room_number = params[:room_number]
        @school_class = SchoolClass.create(params.require(:school_class).permit(:title, :room_number))